A = int(input('Введите значение по дюрометру Д'))
print()
b = A - 1
dic = {6:30, 7:35, 8:40, 10:45, 12:50, 14:55, 16:60, 19:65, 22:70,
25:75, 29:80, 33:85, 39:90, 46:95, 58:100}
keys = [6, 7, 8, 10, 12, 14, 16, 19, 22, 25, 29, 33, 39, 46, 58]
if A in dic:
    print('{} По шкале Д = {} по шкале А'.format(A, dic[A]))
elif A > 58:
    print('более 100, выдаём результат по шкале Д')
elif A < 6:
    print('меньше 30, ищите датчик на шкалу А')
else:
    while b not in dic:
        b = b - 1
    else:
        ans = dic[b]+int(5*((A - b)/(keys[keys.index(b)+1]-b)))
        print('{} По шкале Д = {} по шкале А'.format(A, ans))